{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [1920, 10, 8], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcy4AAAB0AGQBfABqAYMCAQB0AmoDfAB0BHwAagFkAhkAgwF0\nBRoAdAZ0BXQHZgSDAlMAKQNO+gh4LnNoYXBlOukAAAAAKQjaBXByaW502gVzaGFwZdoBS9oHcmVz\naGFwZdoDaW502gFO2hR0aW1lc3RlcHNfcGVyX3NhbXBsZdoBRikB2gF4qQByDAAAAPoYcnVuX0Rl\nZXBMZWFybmluZ01vZGVsLnB52ghzaGFwZV9YMYkAAABzBAAAAAABDAE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.0, "noise_shape": null, "seed": null}}}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "time_distributed_2", "class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "layer": {"class_name": "BatchGraphAttention", "config": {"name": "batch_graph_attention_1", "trainable": true}}}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"name": "time_distributed_3", "class_name": "TimeDistributed", "config": {"name": "time_distributed_3", "trainable": true, "layer": {"class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "rate": 0.0, "noise_shape": null, "seed": null}}}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]]}, {"name": "time_distributed_4", "class_name": "TimeDistributed", "config": {"name": "time_distributed_4", "trainable": true, "layer": {"class_name": "BatchGraphAttention", "config": {"name": "batch_graph_attention_2", "trainable": true}}}, "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [1920, 10, 1], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxIAAAB0AGoBfABkAnQCdANmA4MCUwApA07pAQAAAOn/////\nKQTaAUvaB3Jlc2hhcGXaFHRpbWVzdGVwc19wZXJfc2FtcGxl2gJGXykB2gF4qQByCAAAAPoYcnVu\nX0RlZXBMZWFybmluZ01vZGVsLnB52gpyZXNoYXBlX1gxjQAAAHMCAAAAAAE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["time_distributed_4", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxIAAAB0AGoBfABkAnQCZAFmA4MCUwApA07pAQAAAOn/////\nKQPaAUvaB3Jlc2hhcGXaFHRpbWVzdGVwc19wZXJfc2FtcGxlKQHaAXipAHIHAAAA+hhydW5fRGVl\ncExlYXJuaW5nTW9kZWwucHnaCnJlc2hhcGVfWDKQAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"name": "lstm_2", "class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["lambda_3", 0, 0, {}], ["lstm_1", 0, 1, {}], ["lstm_1", 0, 2, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 1, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}